[
    {
        "key": "1",
        "title": "Religious Areas",
        "category": "Offices",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 5, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "There are two chapels in the main campus of DLSU, and both of them are in St. La Salle Hall. One is on the ground floor, near the accounting office, the other is on the 2nd floor.",
                "The entire 12th floor of Andrew is a retreat area, and an entire building far to the east is also a retreat area. I remember not the name of the building since it is so far away from the main campus, and I am not religious."
            ],
            "comments": [

            ]
    },
    {
        "key": "2",
        "title": "Registrar, Accounting, and Faculties",
        "category": "Offices",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 5, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "For a student, there are only 3 offices that you need: Registrar, Accounting, and Faculty. Accounting has 2 offices, one in St. La Salle Hall (ground floor) and the other in Henry Sy Hall (2nd floor). Henry Sy Hall (2nd floor) also has the Registrar’s office.",
                "There are 4 areas where the faculties are concentrated. Faculties for the sciences (biology, physics, and so on) are in William Hall. Falculties for humanities (linguistics, religion, and so on) are in the Faculty Center. The faculty for computer science is in Andrew (10th floor). The faculty for physical education is in Razon (7th floor)."
            ],
            "comments": [

            ]
    },
    {
        "key": "3",
        "title": "Museum",
        "category": "Offices",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 5, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "Did you know that there’s a museum in DLSU? Well, it’s just in one building, Henry. Along with the library, Henry 7th - 12th also has various artifacts on display. The floor with the most displays is the 12th floor.",
                "If you want a quiet place to sleep, go to Henry 12th, it is almost devoid of people, and the only sound you will hear are the air conditioners running. Well, there are some talking and footsteps, but they are all faint."
            ],
            "comments": [

            ]
    },
    {
        "key": "4",
        "title": "Library",
        "category": "Offices",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 4, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "Honestly, I know not whether to put this under Classrooms or Offices, but here it is, under Offices. The library is Henry 7th to 12th. Five floors of books, no wonder our tuition fee is exorbitant.",
                "There are also discussion rooms here that you can use when you have projects. But the most important service here is the thesis borrowing. If you’re a graduate, you will need to be as abreast as possible with the current research in your field."
            ],
            "comments": [

            ]
    },
    {
        "key": "5",
        "title": "Foreign Affairs",
        "category": "Offices",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 5, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "Should you want to join an exchange program, you can go to Henry 12th. There, you have the following choices: America, China, and Japan. Maybe there are more, but I have not seen them.",
                "You can also read about the various countries in various languages there. There are atlases and brochures, also humanities literature in other languages."
            ],
            "comments": [

            ]
    },
    {
        "key": "6",
        "title": "Andrew 10th Floor",
        "category": "Offices",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 5, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "Computer Science majors are all too familiar with this floor. On this floor is the office of the associate dean. When you need to petition a class, this is where you go to.",
                "The person you are probably going to talk the most with is Ms. Charibeth Cheng. She will accept your petition form. Should there be alternatives, Ms. Grace will talk to you about your options."
            ],
            "comments": [

            ]
    },
    {
        "key": "7",
        "title": "Thai",
        "category": "Food",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 4, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "In Agno, there is a stall where you can buy Thai food for relatively cheap prices. Oddly, the most expensive items on their menu are the large sized desserts. Others are at most ₱100. The name of the stall? Thai Mango. Amusingly, they have an item called Thai Mango. Even more amusing is the fact that it is not a specialty dish, rather an item called Mango Aloha is.",
                "I highly recommend their Thai Chicken. Not only is it savory, it also has a satisfactory serving size. I have not tasted their other items, but I look forward to it. Half of their items are desserts, and most of those are cold desserts."
            ],
            "comments": [

            ]
    },
    {
        "key": "8",
        "title": "Takoyaki",
        "category": "Food",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 5, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "Stands that offer takoyaki offer them at prices that are too expensive for their portion. Case in point, the one in Agno offers 4 pieces for ₱55. I remember not anymore since it has been a while since I went there, but the one along Taft near the Quirino Station of the LRT has portions that are more worth its price.",
                "At any rate, I recommend you to not buy takoyaki, unless you have money to spare. Rather, I recommend you to buy other finger foods especially in Bloemen."
            ],
            "comments": [

            ]
    },
    {
        "key": "9",
        "title": "Potato Based Finger Food",
        "category": "Food",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 4, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "If you want french fries or mojos, you have 3 choices: Potato Corner, Big Potato, and Toribox. Which one of those belongs not? Potato Corner and Big Potato are “traditional” french fry stands. Toribox has other items on their menu, but they offer french fries and mojos.",
                "The difference between Potato Corner and Big Potato? Potato Corner has more size options. As for where to find them, Potato Corner is Bloemen, while Big Potato and Toribox are in Agno.",
                "If you are on a tight budget, I would not recommend you buying from these places, since satisfactory portions cost upwards of ₱100."
            ],
            "comments": [

            ]
    },
    {
        "key": "10",
        "title": "Korean BBQ",
        "category": "Food",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 5, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "Along Taft near DLSU there is a surprising amount of Korean BBQ restaurants, especially considering the major demographic of the area. I would guess that most patrons are not students, rather they are office workers from the offices near DLSU.",
                "Either way, I’m not eating in those places alone since I will be a pitiful sad-sack. I admit, I like eating BBQ, but I want to eat it with my family. Batchmates? Not really."
            ],
            "comments": [

            ]
    },
    {
        "key": "11",
        "title": "Food and Where to find Them",
        "category": "Food",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "February 29, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "There are a  lot of places to get food from in DLSU. The food court and other restaurants along  Calle Agno, another in Bloemen, the cantina in St. La Salle Hall. Not to mention the many restaurants that line the nearby Taft avenue and the Pad just behind that. All in all it is a diverse set.",
                "Students who have the majority of their classes in Gokongwei Hall get their food along Agno. Agno has cheap options for those who are looking to save money.",
                "Students that spend most of their time in Miguel, Yuchengco, St. Joseph and Bloemen Halls would go to Bloemen. Nearby, a bazaar is held annually by business majors.",
				"Students in St. La Salle Hall would go to the cantina.",
				"Unfortunately, I haven’t gone to the cantina nor the food court along Bloemen to know the feel for their food."
            ],
            "comments": [

            ]
    },
    {
        "key": "12",
        "title": "Curry",
        "category": "Food",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 5, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "There are a lot of stands that offer curry, but the main one is Colonel’s Curry in Bloemen. They have the best curry in and around DLSU. It only costs ₱100 for a filling and savory meal. There are stalls in Agno that offer curry, but it is not their specialty. Toribox has the best curry in Agno. The other stalls have better items on their menu."
            ],
            "comments": [

            ]
    },
    {
        "key": "13",
        "title": "Coffee",
        "category": "Food",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 4, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "Want to drink coffee to energize your day? You’re in luck! Within and near the campus are coffee shops! The shops in question are Starbucks and Coffee Bean. Agno has Starbucks and Coffee Bean, while Henry 7th has only Coffee Bean.",
                "Oh, you are out of cash? Don’t worry, you can buy some from 7-Eleven or Ministop."
            ],
            "comments": [

            ]
    },
    {
        "key": "14",
        "title": "Agno and Shawarma",
        "category": "Food",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "February 29, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "The cheapest food in Agno are the instant noodles for ₱20. Although, if you want to take out, you need to add an additional ₱5. I haven’t a personal favorite, but the stall I keep going back to is the stall on the far left and far back. Unfortunately, I know not their name, but their food is good.",
                "Now, as of now (February 2020), Gokongwei Hall hasn’t a place for students to sit down and wait for their next classes. Rather, computer science and engineering students wait at Andrew. The closest food stall to Andrew is the shawarma place in front of 7-Eleven. Like the instant noodles place, this place charges an additional ₱5 for take out. While their food is good, the portions are lacking."
            ],
            "comments": [

            ]
    },
    {
        "key": "15",
        "title": "7-Eleven",
        "category": "Food",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 5, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "A convenience on the higher end of the price range. All that I have bought from there are sodas and chips. The chips, especially the big ones, cost a little over ₱100, so not recommended. They also sell alcohol, but only within a limited period of the day. Also cigarettes, but if you are a smoker, you can buy them cheaper along Castro Street.",
                "I am a little dismayed at the 7-Elevens in the Philippines since they have not onigiri and inarizushi. The branches in Taiwan have them, but alas."
            ],
            "comments": [

            ]
    },
    {
        "key": "16",
        "title": "WiFi in Your Classroom",
        "category": "Classrooms",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 4, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "Nowadays you need WiFi to survive. As students we know this because we need to submit our assignments and what not over the internet through various platforms. Unfortunately, not all classrooms are created equal. Some classrooms have good connections, some haven’t even the slightest.",
                "In Gokongwei Hall, Room 201 is a dead zone, and a classroom; a combination that’s unfavorable to students, especially of the CS kind. Room 301 is a computer laboratory and Animo Connect reaches it not, but it has its own WiFi, G301.",
                "Razon hasn’t any connection, so you have to use cellular data if you want to access the internet. Why would you though? You’re there to exercise."
            ],
            "comments": [

            ]
    },
    {
        "key": "17",
        "title": "Henry 5th Floor",
        "category": "Classrooms",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 5, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "Okay, while it is not a classroom, it is a place where a lot of students gather. For what? Sleep. Henry 5th is a place where you can sleep relatively comfortably, provided there is no one else besides you.",
                "This area is the only place where there are pillows and a place to lie down. I mean you could lie down on the desks in the hang-out places, but doing sp would be really uncomfortable, for both you and others."
            ],
            "comments": [

            ]
    },
    {
        "key": "18",
        "title": "Gokongwei 2nd",
        "category": "Classrooms",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 5, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "On Gokongwei 2nd floor are traditional classrooms, but also noise pollution from the construction on the floor below. Most of the classes done here are theory subjects. Practical classes are done in the computer laboratories on the floor above.",
                "From roaming around the hall, the classes I’ve seen are: history, religion, humanities, calculus, physics, and computer science."
            ],
            "comments": [

            ]
    },
    {
        "key": "19",
        "title": "Computer Laboratories",
        "category": "Classrooms",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 4, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "In Gokongwei, computer laboratories are on the 3rd floor. There are two sizes: 30 seater and 45 seater. Most of the 30 seater labs are on the left side, while the 45 seaters are on the right. All of them come equipped with a projector. In my opinion, it’s better to have the machines reflect what the professor is doing to prevent students from using social media.",
                "The machines in these labs are installed with IDEs and other programs. The programs are freeware."
            ],
            "comments": [

            ]
    },
    {
        "key": "20",
        "title": "Computer Engineering",
        "category": "Classrooms",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 5, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "I am not too well versed in the computer engineering facilities, since I am a computer science major. On Gokongwei 3rd are laboratories where one can tinker with computer parts and bread boards.",
                "I had only one class that involved computer engineering, and we dealt with breadboards, IC chips, wires, and LEDs. It was confusing to say the least. I am glad that I am a programmer and I need not to build my own computers."
            ],
            "comments": [

            ]
    },
    {
        "key": "21",
        "title": "Biology Laboratory",
        "category": "Classrooms",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 4, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "If you are a CS student, the first science class you will have is biology (SCIMATB and LBYMATB). Being a minor class, passing it shouldn’t be too hard. Just the basics of biology. Both are more appreciation classes than anything. In the laboratory, you need to wear a labcoat.",
                "During my time, our LBYMATB professor tasked us to make a  proposal for a technology based on principles of biology. In that project, another biologist rated our proposal and asked questions about it. All in all, a fun project. What’s more, it was after a test in a major subject, so it was liberating to say the least."
            ],
            "comments": [

            ]
    },
    {
        "key": "22",
        "title": "Classrooms and Where to find Them",
        "category": "Classrooms",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "February 29, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "Like we all know, all the classrooms in DLSU are air conditioned for the majority of the day. They don’t use inverters, so the energy consumption is staggering. Maybe that’s where most of our tuition goes. The only building that’s not mostly air conditioned is Razon.",
                "There are many types of classrooms in DLSU: lecture halls, classrooms, science laboratories, computer laboratories, sports fields and many more.",
                "Normal classrooms are present in all buildings of the campus. Computer labs are present in all but Razon. Science laboratories are present in the Science and Technology Research Complex and the St. Joseph Hall. Lecture halls are in Andrew and St. La Salle Halls.",
				"Razon has a swimming pool, 2 half basketball courts, a full basketball court, an oval running track, and dancing rooms. It also has a Gold Gym."
            ],
            "comments": [

            ]
    },
    {
        "key": "23",
        "title": "Thesis",
        "category": "Classrooms",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 5, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "On Gokongwei 4th, there are rooms you can use for research. They are rooms where you can code in peace and collaborate with your partner or group, or wait for your computer to do some task.",
                "According to a professor: the computers in those rooms have sticky notes on them saying “Don’t Touch,” because they are doing some calculation."
            ],
            "comments": [

            ]
    },
    {
        "key": "24",
        "title": "Places to hang out",
        "category": "Classrooms",
        "author": "Hans",
		"authoremail": "hans_lao@dlsu.edu.ph",
        "date": "March 5, 2020",
        "imgext": "png",
        "text_preview": "",
        "tags": [
                
            ],
            "text": [
                "Depending on your schedule, you'll want somewhere to sit down and wait. Preferably, there should be electrical outlets, desks, benches, and internet connection.",
                "Well, the one in Gokongwei is still being renovated as of March 2020, so CS students have to make do with the one in Andrew. There are also hang-out places near Yuchengco and in the Corazon Aquino Democratic Space.",
                "Thankfully, all hang-out places have internet connection and benches. The presence of desks and electrical outlets depend on where you are."
            ],
            "comments": [

            ]
    }
]